export default [
  {
    name: "Αρμονικό μινόρε",
    intervals: [2, 1, 2, 2, 1, 3, 1],
    chordsFromD: ["D-", "A+", "D-", "G-", "A+", "A#+", "A+"],
  },
  {
    name: "Διατονικό μινόρε",
    intervals: [2, 1, 2, 2, 1, 2, 2],
    otherNames: [
      "Φυσικό μινόρε",
      "Μελωδικό μινόρε καθοδικό",
      "Νησιώτικο μινόρε",
      "Αιολικός",
      "Χουσεΐνι καθοδικό",
      "Μπουσελίκ",
    ],
    chordsFromD: ["D-", "C+", "F+", "G-", "D-", "A#+", "C+"],
  },
  {
    name: "Καρτσιγάρ",
    intervals: [2, 1, 2, 1, 3, 1, 2],
  },
  {
    name: "Κιουρδί",
    intervals: [2, 1, 2, 2, 2, 1, 2],
    otherNames: ["Δωρικός", "Νεβά"],
  },
  {
    name: "Λοκρικός",
    intervals: [1, 2, 2, 1, 2, 2, 2],
  },
  {
    name: "Λυδικός",
    intervals: [2, 2, 2, 1, 2, 2, 1],
  },
  {
    name: "Μελωδικό μινόρε ανοδικό",
    intervals: [2, 1, 2, 2, 2, 2, 1],
    chordsFromD: ["D-", "E-", "D-", "G+", "A+", "G+", "A+"],
  },
  {
    name: "Νιαβέντ",
    intervals: [2, 1, 3, 1, 1, 3, 1],
    otherNames: ["Τσιγγάνικο μινόρε"],
    chordsFromD: ["D-", "A+", "D-", "G#dim", "D-", "A#+", "A+"],
  },
  {
    name: "Νικρίζ",
    intervals: [2, 1, 3, 1, 2, 2, 1],
  },
  {
    name: "Ουσάκ",
    intervals: [1, 2, 2, 2, 1, 2, 2],
    otherNames: ["Φρυγικός"],
    chordsFromD: ["D-", "D#+", "F+", "G-", "D-", "D#+", "C-"],
  },
  {
    name: "Ουζάλ",
    intervals: [1, 3, 1, 2, 2, 1, 2],
  },
  {
    name: "Ποιμενικό μινόρε",
    intervals: [2, 1, 3, 1, 2, 1, 2],
    otherNames: ["Ρουμάνικο μινόρε"],
  },
  {
    name: "Πειραιώτικος",
    intervals: [1, 3, 2, 1, 1, 3, 1],
  },
  {
    name: "Πειραιώτικος (παραλλαγή)",
    intervals: [1, 4, 1, 1, 1, 3, 1],
  },
  {
    name: "Ραστ ανοδικό",
    intervals: [2, 2, 1, 2, 2, 2, 1],
    otherNames: ["Ματζόρε", "Ιωνικός"],
  },
  {
    name: "Ραστ καθοδικό",
    intervals: [2, 2, 1, 2, 2, 1, 2],
    otherNames: ["Μιξολυδικός", "Χουσεΐνι ανοδικό"],
  },
  {
    name: "Σαμπάχ",
    intervals: [2, 1, 1, 3, 1, 2, 2],
    chordsFromD: ["D-", "C+", "F+", "F#+", "D-", "A#+", "C+"],
  },
  {
    name: "Σαμπάχ (παραλλαγή)",
    intervals: [2, 1, 1, 3, 1, 2, 1],
    chordsFromD: ["D-", "C+", "F+", "F#+", "D-", "A#+", "C+"],
  },
  {
    name: "Σεγκιάχ",
    intervals: [3, 1, 1, 2, 1, 3, 1],
  },
  {
    name: "Σουζινάκ",
    intervals: [2, 1, 3, 1, 1, 2, 2],
  },
  {
    name: "Ταμπαχανιώτικος",
    intervals: [2, 2, 1, 2, 1, 3, 1],
  },
  {
    name: "Χιτζάζ",
    intervals: [1, 3, 1, 2, 1, 2, 2],
    otherNames: ["Χιουμαγιούν"],
    chordsFromD: ["D+", "D#+", "D+", "G-", "D+", "G-", "C-"],
  },
  {
    name: "Χιτζαζκιάρ",
    intervals: [1, 3, 1, 2, 1, 3, 1],
  },
  {
    name: "Χουζάμ",
    intervals: [3, 1, 1, 2, 2, 2, 1],
  },
];
