export default [
  {
    name: "Αρμονικό μινόρε",
    intervals: [2, 1, 2, 2, 1, 3, 1],
  },
  {
    name: "Διατονικό μινόρε",
    intervals: [2, 1, 2, 2, 1, 2, 2],
    otherNames: [
      "Νησιώτικο μινόρε",
      "Αιολικός",
      "Χουσεΐνι καθοδικό",
      "Μπουσελίκ",
    ],
  },
  {
    name: "Καρτσιγάρ",
    intervals: [2, 1, 2, 1, 3, 1, 2],
  },
  {
    name: "Κιουρντί",
    intervals: [2, 1, 2, 2, 2, 1, 2],
    otherNames: ["Δωρικός", "Νεβά"],
  },
  {
    name: "Λοκρικός",
    intervals: [1, 2, 2, 1, 2, 2, 2],
  },
  {
    name: "Λυδικός",
    intervals: [2, 2, 2, 1, 2, 2, 1],
  },
  {
    name: "Μελωδικό μινόρε",
    intervals: [2, 1, 2, 2, 2, 2, 1],
  },
  {
    name: "Νιαβέντ",
    intervals: [2, 1, 3, 1, 1, 3, 1],
    otherNames: ["Τσιγγάνικο μινόρε"],
  },
  {
    name: "Νικρίζ",
    intervals: [2, 1, 2, 1, 3, 2, 1],
  },
  {
    name: "Ουσάκ",
    intervals: [1, 2, 2, 2, 1, 2, 2],
    otherNames: ["Φρυγικός"],
  },
  {
    name: "Ουζάλ",
    intervals: [1, 3, 1, 2, 2, 1, 2],
  },
  {
    name: "Ποιμενικό μινόρε",
    intervals: [2, 1, 3, 1, 2, 1, 2],
    otherNames: ["Ρουμάνικο μινόρε"],
  },
  {
    name: "Πειραιώτικος",
    intervals: [1, 3, 2, 1, 1, 3, 1],
  },
  {
    name: "Ραστ ανοδικό",
    intervals: [2, 2, 1, 2, 2, 2, 1],
    otherNames: ["Ματζόρε", "Ιωνικός"],
  },
  {
    name: "Ραστ καθοδικό",
    intervals: [2, 2, 1, 2, 2, 1, 2],
    otherNames: ["Μιξολυδικός", "Χουσεΐνι ανοδικό"],
  },
  {
    name: "Σαμπάχ",
    intervals: [2, 1, 1, 3, 1, 2, 2],
  },
  {
    name: "Σαμπάχ (παραλλαγή)",
    intervals: [2, 1, 1, 3, 1, 2, 1],
  },
  {
    name: "Σεγκιάχ",
    intervals: [3, 1, 1, 2, 1, 3, 1],
  },
  {
    name: "Σουζινάκ",
    intervals: [2, 1, 3, 1, 1, 2, 2],
  },
  {
    name: "Ταμπαχανιώτικος",
    intervals: [2, 2, 1, 2, 1, 3, 1],
  },
  {
    name: "Χιτζάζ",
    intervals: [1, 3, 1, 2, 1, 2, 2],
    otherNames: ["Χιουμαγιούν"],
  },
  {
    name: "Χιτζαζκιάρ",
    intervals: [1, 3, 1, 2, 1, 3, 1],
  },
  {
    name: "Χουζάμ",
    intervals: [3, 1, 1, 2, 2, 2, 1],
  },
];
